{
    "intents": [
        {
            "tag": "greeting",
            "patterns": ["Hi", "Hello", "Hey", "How are you", "What's up"],
            "responses": ["Hello! How are you feeling today?", "Hey there! How's your mood today?", "Hi! Ready to discover music that matches your mood?"]
        },
        {
            "tag": "goodbye",
            "patterns": ["Bye", "See you", "Goodbye", "I'm leaving", "Talk to you later"],
            "responses": ["Goodbye! Come back when you want more music recommendations.", "See you later! Hope you enjoy the songs.", "Take care and enjoy the music!"]
        },
        {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for the help"],
            "responses": ["Happy to help!", "Anytime!", "You're welcome.", "My pleasure."]
        },
        {
            "tag": "music",
            "patterns": ["Recommend songs", "What should I listen to", "Music recommendation", "Suggest some music", "Give me a playlist"],
            "responses": ["I'll analyze your mood and recommend songs. How are you feeling?", "I need to understand your emotions to suggest the right music. Tell me more about how you feel.", "I'd be happy to recommend music based on your mood. Could you describe how you're feeling?"]
        },
        {
            "tag": "mood_happy",
            "patterns": ["I'm happy", "Feeling great", "I'm in a good mood", "Feeling joyful", "I'm excited"],
            "responses": ["Glad to hear you're happy! I'll find some upbeat songs for you.", "Awesome! Let me recommend some positive music to match your mood.", "That's great! I'll suggest some cheerful tunes."]
        },
        {
            "tag": "mood_sad",
            "patterns": ["I'm sad", "Feeling down", "I'm depressed", "Not feeling good", "I'm upset"],
            "responses": ["I'm sorry to hear that. Would you like some comforting music?", "I understand. I'll find some songs that might help you feel better.", "Let me recommend some music that might lift your spirits."]
        },
        {
            "tag": "mood_angry",
            "patterns": ["I'm angry", "I'm furious", "So annoyed", "I'm mad", "Feeling frustrated"],
            "responses": ["I see you're feeling angry. Would you like some music to help release that tension?", "I'll suggest some tracks that might help you process those feelings.", "Let me find music that matches your intense energy right now."]
        },
        {
            "tag": "mood_relaxed",
            "patterns": ["I'm relaxed", "Feeling chill", "I'm calm", "Very peaceful", "I'm zen"],
            "responses": ["Sounds like you're in a peaceful state. I'll find some music to maintain that vibe.", "Great! I'll recommend some gentle, calming tunes to match your mood.", "I have some perfect ambient tracks for your relaxed state."]
        },
        {
            "tag": "help",
            "patterns": ["Help", "What can you do", "How do you work", "What are your features", "How to use"],
            "responses": ["I can analyze your emotions and recommend songs that match your mood. Just tell me how you're feeling or chat with me for a while.", "I'm an emotion-based music recommendation chatbot. I suggest songs based on how you're feeling. Just keep chatting and I'll analyze your mood.", "I recommend music based on your emotional state. The more you chat with me, the better I can understand your current mood."]
        },
        {
            "tag": "hindi_music",
            "patterns": ["Hindi songs", "Bollywood music", "Indian songs", "Recommend Hindi songs", "Suggest Bollywood songs"],
            "responses": ["I'd be happy to recommend some Hindi songs! What mood are you in?", "Hindi songs are great! Let me find some based on your current mood.", "I can suggest Bollywood songs that match how you're feeling."]
        }
    ]
}